---
kind: method
id: M:Autodesk.Revit.UI.RibbonItemData.GetContextualHelp
source: html/b1f605c9-fc69-f8ee-ef3f-cb0e55901a16.htm
---
# Autodesk.Revit.UI.RibbonItemData.GetContextualHelp Method

Gets the contextual help bound with this control.

## Syntax (C#)
```csharp
public ContextualHelp GetContextualHelp()
```

## Returns
The contextual help assigned to the item, or Nothing nullptr a null reference ( Nothing in Visual Basic) if there is no binding assigned.